{"data":[{"securityData":[{"security":"TFSC US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":0,"fieldData":{"DS318":"1347 Capital Corp. is a blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more businesses or entities.","DS588":"www.1347capital.com"}},{"security":"TFSCR US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":1,"fieldData":{"DS318":"1347 Capital Corp. is a blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more businesses or entities.","DS588":"www.1347capital.com"}},{"security":"TFSCU US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":2,"fieldData":{"DS318":"1347 Capital Corp. is a blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more businesses or entities.","DS588":"www.1347capital.com"}},{"security":"TFSCW US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":3,"fieldData":{"DS318":"1347 Capital Corp. is a blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more businesses or entities.","DS588":"www.1347capital.com"}},{"security":"PIH US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":4,"fieldData":{"DS318":"1347 Property Insurance Holdings, Inc. is a property and casualty insurance holding company. The Company offers insurance coverage including homeowners' insurance, manufactured home insurance and dwelling fire insurance.","DS588":"www.maisonins.com"}},{"security":"FLWS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":5,"fieldData":{"DS318":"1-800-FLOWERS.COM, Inc. is an e-commerce provider of floral products and gifts. The Company's product offerings, including fresh-cut and seasonal flowers, plants, floral arrangements, and home and garden merchandise, can be purchased online or by calling its toll-free telephone number.","DS588":"www.1-800-flowers.com"}},{"security":"FCTY US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":6,"fieldData":{"DS318":"1st Century Bancshares, Inc. is a business and professional bank serving customers in Los Angeles County, California. The Bank provides a range of deposit products, loans, and other services to individuals, businesses, and prof essionals through an office located in Los Angeles.","DS588":"www.1stcenturybank.com"}},{"security":"FCCY US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":7,"fieldData":{"DS318":"1st Constitution Bancorp is the holding company for 1st Constitution Bank. The Bank provides a wide range of business and consumer financial services. 1st Constitution has offices in Cranbury, Montgomery, Hamilton, and Plainsboro, New Jersey.","DS588":"www.1stconstitutionbank.com"}},{"security":"SRCE US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":8,"fieldData":{"DS318":"1st Source Corporation is the holding company for 1st Source Bank. The Bank attracts deposits and offers commercial banking, personal banking and trust services to customers in northern Indiana and southwestern Michigan. 1st Source's Specialty Finance Group provides leases and financing for aircraft, automobiles, trucks and construction equipment.","DS588":"www.1stsource.com"}},{"security":"VNET US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":9,"fieldData":{"DS318":"21Vianet Group, Inc. provides carrier-neutral Internet data center services. The Company hosts its customers' servers and networking equipment, as well as provides interconnectivity and managed network services to enable customers to deliver data across the Internet. 21Vianet conducts business in Beijing, China.","DS588":"www.21vianet.com"}}]},{"securityData":[{"security":"ALXN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":90,"fieldData":{"DS318":"Alexion Pharmaceuticals, Inc., a biopharmaceutical company, researches and develops proprietary immunoregulatory compounds for the treatment of autoimmune and cardiovascular diseases. The Company develops C5 complement inhibitors and Apogens which are two classes of potential therapeutic compounds designed to selectively target specific disease-causing segments of the immune system.","DS588":"www.alexionpharm.com"}},{"security":"ALXA US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":91,"fieldData":{"DS318":"Alexza Pharmaceuticals, Inc. is a pharmaceutical company focused on the development and commercialization of proprietary products for the treatment of acute and intermittent conditions.","DS588":"www.alexza.com"}},{"security":"ALCO US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":92,"fieldData":{"DS318":"Alico, Inc. is involved in various agribusiness activities and operations, including citrus fruit production, cattle ranching, sugarcane and sod production, and forestry. The Company also leases land for farming, cattle grazing, recreation, and oil exploration. Alico conducts operations in central and southwest Florida.","DS588":"www.alicoinc.com"}},{"security":"ALGN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":93,"fieldData":{"DS318":"Align Technology, Inc. designs, manufactures, and markets the Invisalign System, a method for treating the misalignment of teeth. The Company's system corrects the misalignment using a series of clear, removable appliances that move teeth to a desired final position.","DS588":"www.invisalign.com"}},{"security":"ALIM US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":94,"fieldData":{"DS318":"Alimera Sciences Inc. is a biopharmaceutical company. The Company researches, develops and commercializes prescription ophthalmic pharmaceuticals. Alimera Sciences is focused on diseases affecting the lining in the back of the eye, or retina.","DS588":"www.alimerasciences.com"}},{"security":"ALKS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":95,"fieldData":{"DS318":"Alkermes PLC researches pharmaceuticals. The Company develops treatments for central nervous system disorders such as addiction, schizophrenia and depression; and diabetes.","DS588":"www.alkermes.com"}},{"security":"ALGT US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":96,"fieldData":{"DS318":"Allegiant Travel Company is a leisure travel company. The Company operates a passenger airline marketed to leisure travelers in small cities.","DS588":"www.allegiantair.com"}},{"security":"ALLB US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":97,"fieldData":{"DS318":"Alliance Bancorp, Inc. of Pennsylvania is a bank holding company. The Bank provides a range of loans and deposit products to consumers as well as businesses.","DS588":"www.alliancebk.com"}},{"security":"AFOP US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":98,"fieldData":{"DS318":"Alliance Fiber Optic Products, Inc. designs, manufactures, and markets a variety of high performance fiber optic components and modular solutions for leading and emerging communications equipment manufacturers. The Company offers a broad product line of passive optical components including interconnect systems and couplers and splitters.","DS588":"www.afop.com"}},{"security":"AIQ US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":99,"fieldData":{"DS318":"Alliance HealthCare Services, Inc. provides outsourced diagnostic imaging services. The Company provides imaging and therapeutic services primarily to hospitals and other healthcare providers on a mobile, shared-service basis. Alliance also provides systems that are located full-time at particular hospitals and clinics. The Company also offers radiation therapy services.","DS588":"www.alliancehealthcareservices-us.com"}}]},{"securityData":[{"security":"ABGB US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":20,"fieldData":{"DS318":"Abengoa S.A. is an international company that applies technology solutions for sustainable development in the energy and environment sectors. The Company's technology generates electricity from the sun, produces biofuels, desalinates seawater and recycles industrial waste.","DS588":"www.abengoa.es"}},{"security":"ABMD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":21,"fieldData":{"DS318":"Abiomed, Inc. develops, manufactures and markets cardiovascular products.The Company develops technologies designed to assist or replace the pumping function of the heart. Abiomed's products and services are used by healthcare professionals in the U.S., Canada and the EU.","DS588":"www.abiomed.com"}},{"security":"AXAS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":22,"fieldData":{"DS318":"Abraxas Petroleum Corporation acquires producing oil and gas properties. The Company explores for and produces crude oil and natural gas in Texas, Wyoming, and Canada. Abraxas also operates or owns an interest in various gas processing plants in Canada.","DS588":"www.abraxaspetroleum.com"}},{"security":"ACTG US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":23,"fieldData":{"DS318":"Acacia Research, through its subsidiaries, develops, acquires, and licenses patented technologies. The Company controls patent portfolios covering technologies used in a variety of industries.","DS588":"www.acaciaresearch.com"}},{"security":"ACHC US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":24,"fieldData":{"DS318":"Acadia Healthcare operates a network of behavioral health centers. The Company provides psychiatric and chemical dependency services, inpatient psychiatric hospitals, residential treatment centers, outpatient clinics, and therapeutic school based programs across the United States.","DS588":"www.acadiahealthcare.com"}},{"security":"ACAD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":25,"fieldData":{"DS318":"ACADIA Pharmaceuticals Inc. is a biopharmaceutical company focused on the discovery, development and commercialization of small molecule drugs for the treatment of central nervous system disorders. The company is currently working on the treatment of induced dysfunction in Parkinson's disease ,schizophrenia, neuropathic pain and glaucoma.","DS588":"www.acadia-pharm.com"}},{"security":"ACST US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":26,"fieldData":{"DS318":"Acasti Pharma Inc is a pharmaceutical company. The Company develops drugs for cardiovascular diseases. Acasti offers omega-3 phospholipids a major component of cell membranes.","DS588":"www.neptunebiotech.com"}},{"security":"AXDX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":27,"fieldData":{"DS318":"Accelerate Diagnostics Inc. develops diagnostic systems for bacterial infections.","DS588":"www.acceleratediagnostics.com"}},{"security":"XLRN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":28,"fieldData":{"DS318":"Acceleron Pharma, Inc. provides pharmaceutical products. The Company focuses on discovering, developing, manufacturing, and marketing of protein therapeutics for cancer and orphan diseases. Acceleron Pharma serves patients throughout the United States.","DS588":"www.acceleronpharma.com"}},{"security":"ANCX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":29,"fieldData":{"DS318":"Access National Corporation is the holding company for Access National Bank, a national bank that provides general commercial banking services in northern Virginia. The Bank also, through its subsidiaries, provides mortgages and equipment and vehicle leasing.","DS588":"www.accessnationalbank.com"}}]},{"securityData":[{"security":"TWOU US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":10,"fieldData":{"DS318":"2U, Inc. provides online educational services. The Company offers graduate and undergraduate degree programs in social work, data science, public administration, healthcare, laws, and industrial relations. 2U serves customers worldwide.","DS588":"www.2u.com"}},{"security":"DGLD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":11,"fieldData":{"DS318":"VelocityShares 3x Inverse Gold ETN is an exchange-traded note issued in the USA. The Note will provide investors with a cash payment at the scheduled maturity or early redemption based on the performance of the underlying index, the S&P GSCI® Gold Index Excess Return.","DS588":"www.velocityshares.com"}},{"security":"JOBS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":12,"fieldData":{"DS318":"51job, Inc. provides integrated human resource services in China, with a strong focus on recruitment related services. The Company's recruitment related services are delivered in both print and online formats.","DS588":"www.51job.com"}},{"security":"SIXD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":13,"fieldData":{"DS318":"6D Global Technologies, Inc. is a holding company. The Company manages a portfolio of digital business solutions companies. 6D Global operates in the United States.","DS588":"www.6dglobal.com"}},{"security":"EGHT US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":14,"fieldData":{"DS318":"8x8, Inc. provides voice-over-Internet protocol creation platforms, hosted Internet PBX solutions, voice and video semiconductors, and related software. The Company offers service providers the tools to create next-generation Internet protocol network services, while providing telecommunications manufacturers with embedded technology, software stacks, and reference designs.","DS588":"www.8x8.com"}},{"security":"AVHI US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":15,"fieldData":{"DS318":"AV Homes, Inc. is engaged in homebuilding, land development and other real estate operations in Florida and Arizona. The Company's principal operations are conducted at its active adult communities as well as builds homes for people of all ages in Central Florida and Phoenix.","DS588":"www.avhomesinc.com"}},{"security":"SHLM US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":16,"fieldData":{"DS318":"A. Schulman, Inc. supplies plastic compounds and resins which are used as raw materials by its customers. The Company combines basic resins purchased from basic resin producers and enhances them with additives. Schulman generally produces compounds to meet customer requirements and on the basis of customer commitments, but also buys and then resells prime and off-grade plastic resins.","DS588":"www.aschulman.com/default.aspx"}},{"security":"AAON US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":17,"fieldData":{"DS318":"AAON, Inc. designs, manufactures, and markets commercial rooftop air-conditioning, heating and heat recovery equipment, and air-conditioning coils. The Company's products serve the commercial and industrial new construction and replacement markets.","DS588":"www.aaon.com"}},{"security":"ABAX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":18,"fieldData":{"DS318":"Abaxis, Inc. develops, manufactures, and markets portable blood analysis systems for use in any patient care setting. The Company's systems provide clinicians with rapid blood constituent measurements. Abaxis currently markets the VetScan for veterinary use and the Piccolo for human medical use. The Company's products are sold in the United States, as well as in Europe and Japan.","DS588":"www.abaxis.com"}},{"security":"ABY US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":19,"fieldData":{"DS318":"Abengoa Yield plc is a total return company. The Company owns a diversified portfolio of contracted renewable energy, power generation and electric transmission assets in North America, South America and Europe.","DS588":"www.abengoayield.com"}}]},{"securityData":[{"security":"ACPW US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":40,"fieldData":{"DS318":"Active Power, Inc. designs, manufactures, and markets power quality products that ensure a constant supply of electricity to computers. The Company's flywheel energy storage system provides a non-toxic replacement for lead-acid batteries used in conventional power quality installations.","DS588":"www.activepower.com"}},{"security":"ATVI US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":41,"fieldData":{"DS318":"Activision Blizzard, Inc. publishes, develops, and distributes interactive entertainment software and peripheral products. The Company's products cover diverse game categories, including action/adventure, action sports, racing, role playing, simulation, first-person action, music-based gaming and strategy.","DS588":"www.activision.com"}},{"security":"ACTA US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":42,"fieldData":{"DS318":"Actua Corporation is a multi-vertical cloud company that provides business-to-business software and solutions. The Company offers cloud-based software and solutions that automate process in insurance, government and compliance.","DS588":"www.actua.com"}},{"security":"ACUR US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":43,"fieldData":{"DS318":"Acura Pharmaceuticals Inc. is a pharmaceutical technology development company. The Company researches, develops, and manufactures active pharmaceutical ingredients (APIs) used as raw materials in the production of pharmaceutical products. Acura has developed technologies for use in narcotic-based pain management products.","DS588":"www.acurapharm.com"}},{"security":"ACXM US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":44,"fieldData":{"DS318":"Acxiom Corporation is a marketing services and information technology company with operations in the United States, Europe, Asia-Pacific and South America.","DS588":"www.acxiom.com"}},{"security":"ADMS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":45,"fieldData":{"DS318":"Adamas Pharmaceuticals, Inc. manufactures drugs. The Company develops therapeutics for the treatment of neurological and infectious diseases. Adamas Pharmaceuticals offers its products to the medical, pharmaceutical and healthcare industries in the United States.","DS588":"www.adamaspharma.com"}},{"security":"ADMP US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":46,"fieldData":{"DS318":"Adamis Pharmaceuticals Corporation is a bio-pharmaceuticals company. The Company develops and distributes specialty pharmaceutical products in the therapeutic areas of oncology, immunology, infectious diseases, allergy and respiratory. Adamis Pharmaceuticals offers its products to the healthcare industry.","DS588":"www.adamispharmaceuticals.com"}},{"security":"ADUS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":47,"fieldData":{"DS318":"Addus HomeCare Corp provides a broad range of social and medical services in the home. The Company's services include personal care and assistance with activities of daily living, skilled nursing and rehabilitative therapies, and adult day care. Addus consumers are individuals with special needs who are at risk of hospitalization or institutionalization.","DS588":"www.addus.com"}},{"security":"AEY US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":48,"fieldData":{"DS318":"ADDvantage Technologies Group, Inc. distributes new, used, and refurbished cable television equipment, as well as repairs equipment for cable companies. The Company's customers include cable television system operators, hotels, motels, hospitals, apartments, and other companies involved in the distribution of television signals.","DS588":"www.addvantagetech.com"}},{"security":"ADEP US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":49,"fieldData":{"DS318":"Adept Technology, Inc. designs, manufactures, and markets robots. The Company's products are used by manufacturers in the electronics, telecommunications, appliances, pharmaceuticals, food processing, and automotive components industries.","DS588":"www.adept.com"}}]},{"securityData":[{"security":"AKAM US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":80,"fieldData":{"DS318":"Akamai Technologies, Inc. provides services for accelerating and improving the delivery of content and applications over the Internet; ranging from live and on-demand streaming video capabilities to conventional content on websites, to tools that help people transact business and reach out to new and existing customers.","DS588":"www.akamai.com"}},{"security":"AKBA US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":81,"fieldData":{"DS318":"Akebia Therapeutics, Inc. manufactures biopharmaceutical products. The Company develop and distributes novel therapeutics based on the biology of hypoxia inducible factor (HIF) for patients with kidney diseases. Akebia Therapeutics serves customers in the United States.","DS588":"www.akebia.com"}},{"security":"AKER US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":82,"fieldData":{"DS318":"Akers Biosciences, Inc. develops diagnostic kits. The Company produces kits that screen blood, urine, or saliva to rapidly diagnose HIV, hepatitis B, lyme disease, sexually transmitted diseases, mononucleosis, rheumatoid arthritis, hepatitis C, malaria and the presence of alcohol and several drugs. The kits can be used in clinics, hospitals, and doctors' offices.","DS588":"www.akerslaboratories.com/"}},{"security":"AKRX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":83,"fieldData":{"DS318":"Akorn, Inc. develops, manufactures, and markets ophthalmic and injectable pharmaceutical products. The Company sells various diagnostic and therapeutic pharmaceutical products focused primarily on ophthalmology, anesthesia, antidotes, and rheumatology. Akorn also markets ophthalmic surgical instruments and other supplies, and provides contract manufacturing for third parties.","DS588":"www.akorn.com"}},{"security":"ALSK US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":84,"fieldData":{"DS318":"Alaska Communications Systems Group Inc. is a full-service telecommunications provider in Alaska. The Company offers local telephone, wireless, long distance, and Internet services to businesses and residential customers through-out the state. Alaska Communications' network infrastructure consists of fiber optic cable and numerous switching facilities.","DS588":"www.acsalaska.com"}},{"security":"AMRI US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":85,"fieldData":{"DS318":"Albany Molecular Research, Inc., an integrated chemistry outsourcing company, offers a variety of chemistry research and development services. The Company provides its services to pharmaceutical and biotechnology companies involved in drug discovery and development. Albany offers medicinal chemistry, chemical development, analytical chemistry services, and small-scale manufacturing.","DS588":"www.albmolecular.com"}},{"security":"ABDC US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":86,"fieldData":{"DS318":"Alcentra Capital Corporation operates as a non-diversified, closed-end management investment company. The Company provides debt and equity financing solutions to lower middle-market companies.","DS588":"www.alcentracapital.com"}},{"security":"ADHD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":87,"fieldData":{"DS318":"Alcobra Ltd. operates as a biopharmaceutical company. The Company develops a patented, non-stimulant pharmaceutical drug designed to treat Attention Deficit Hyperactivity Disorder and other cognitive disorders.","DS588":"www.alcobra-pharma.com"}},{"security":"ALDR US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":88,"fieldData":{"DS318":"Alder Biopharmaceuticals, Inc. provides pharmaceutical products and services. The Company offers identifies, develops, and manufactures antibody therapeutics to alleviate human suffering in cancer, pain, cardiovascular, and autoimmune and inflammatory disease areas. Alder Biopharmaceuticals operates in the United States.","DS588":"www.alderbio.com"}},{"security":"ALDX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":89,"fieldData":{"DS318":"Aldeyra Therapeutics, Inc. develops drugs for capturing and removing free aldehydes. The Company products target immune-mediated, inflammatory, orphan, and other diseases. Aldeyra Therapeutics serves customers in the United States","DS588":"www.aldeyra.com"}}]},{"securityData":[{"security":"AHGP US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":100,"fieldData":{"DS318":"Alliance Holdings GP LP owns and controls Alliance Resource Management GP, LLC, the managing general partner of Alliance Resource Partners, L.P. (ARLP). ARLP produces and markets coal United States utilities and industrial users.","DS588":"www.ahgp.com"}},{"security":"ARLP US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":101,"fieldData":{"DS318":"Alliance Resource Partners, L.P. produces and markets coal to United States utilities and industrial users. The Company operates its facilities in Kentucky, Illinois, and Maryland.","DS588":"www.arlp.com"}},{"security":"AHPI US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":102,"fieldData":{"DS318":"Allied Healthcare Products, Inc. manufactures a variety of respiratory products. The Company's products are used in the health care industry in a variety of hospital and alternate site settings, including sub-acute care facilities, home health care, and emergency medical care. Products include respiratory care products, medical gas construction equipment, and emergency medical products.","DS588":"www.alliedhpi.com"}},{"security":"AMOT US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":103,"fieldData":{"DS318":"Allied Motion Technologies, Inc. designs, manufactures, and sells motion control products into applications that serve various industry sectors. The Company supplies precision and specialty motion control components and systems to a range of customers throughout the world.","DS588":"www.alliedmotion.com"}},{"security":"ALQA US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":104,"fieldData":{"DS318":"Alliqua BioMedical, Inc. operates as a biomedical company. The Company focuses on the development, manufacturing, and distribution of transdermal wound care and drug delivery technologies, including its technology platform for producing hydrogels. Alliqua BioMedical offers its products to the healthcare industry, including wound healing, medical diagnostics, and cosmeceuticals.","DS588":"www.alliqua.com"}},{"security":"ALLT US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":105,"fieldData":{"DS318":"Allot Communications Ltd. designs and develops broadband service optimization solutions using advanced deep packet inspection (DPI) technology. The Company provides their customers with real-time highly granular visibility into network traffic and enables them to effectively manage and optimize their networks.","DS588":"www.allot.com"}},{"security":"MDRX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":106,"fieldData":{"DS318":"Allscripts Healthcare Solutions, Inc. develops and markets clinical software. The Company's products include electronic health records, electronic prescribing, revenue cycle management, practice management, document management, medication services, hospital care management, emergency department information systems and homecare automation.","DS588":"www.allscripts.com"}},{"security":"AFAM US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":107,"fieldData":{"DS318":"Almost Family Inc. provides senior healthcare services. The Company offers senior skilled nursing care management, cardiovascular disease treatment, physical rehabilitation, and speech therapy services. Almost Family serves patients throughout the United States.","DS588":"www.almostfamily.com"}},{"security":"ALNY US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":108,"fieldData":{"DS318":"Alnylam Pharmaceuticals Inc. is an early-stage therapeutics company. The Company is developing technology that can specifically and potently silence disease-causing genes.","DS588":"www.alnylam.com"}},{"security":"AOSL US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":109,"fieldData":{"DS318":"Alpha & Omega Semiconductor Ltd. designs and manufactures semiconductors. The Company produces analog switches, power integrated circuits, and transient voltage suppressors for notebook computers, battery pack protection, liquid crystal display backlight inverters, cellular phones, and digital cameras. Alpha & Omega Semiconductor conducts operations internationally.","DS588":"www.aosmd.com"}}]},{"securityData":[{"security":"AFFX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":70,"fieldData":{"DS318":"Affymetrix, Inc. develops and manufactures DNA chip technology. The Company's GeneChip system acquires, analyzes, and manages genetic information in order to improve the diagnosis, monitoring, and treatment of disease. Affymetrix's product consists of DNA probe arrays containing gene sequences on a chip, a scanner to process the probe arrays, and software to analyze the information.","DS588":"www.affymetrix.com"}},{"security":"AGEN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":71,"fieldData":{"DS318":"Agenus, Inc. develops vaccines. The Company researches vaccines for brain cancer, kidney cancer, herpes, lung cancer, melanoma, malaria, shingles, and Alzheimer's disease.","DS588":"www.agenusbio.com"}},{"security":"AGRX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":72,"fieldData":{"DS318":"Agile Therapeutics, Inc. develops women's healthcare products. The Company provides contraceptive patch containing the active ingredients levonorgestrel and ethinyl estradiol, as well as progestin-only birth control patch. Agile Therapeutics discovers and develops a pipeline of investigational contraceptive products in the United States.","DS588":"www.agiletherapeutics.com"}},{"security":"AGYS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":73,"fieldData":{"DS318":"Agilysys, Inc. is a developer and marketer of proprietary enterprise software, services and solutions to the hospitality and retail industries. The Company specializes in market-leading point-of-sale, property management, inventory & procurement and mobile & wireless solutions that are designed to streamline operations, improve efficiency and enhance the consumer's experience.","DS588":"www.agilysys.com"}},{"security":"AGIO US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":74,"fieldData":{"DS318":"Agios Pharmaceuticals, Inc. discovers and develops therapeutics in the field of cancer metabolism. The Company develops drugs focusing on glycolysis, fatty acid metabolism, and autophagy. Agios Pharmaceuticals operates in the United States.","DS588":"www.agios.com"}},{"security":"AIRM US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":75,"fieldData":{"DS318":"Air Methods Corporation provides aeromedical emergency transport services and systems throughout North America. The Company provides transportation services to hospitals throughout the U.S. In addition, Air Methods designs, manufactures, and installs medical aircraft interiors and other aerospace products.","DS588":"www.airmethods.com"}},{"security":"AIRT US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":76,"fieldData":{"DS318":"Air T., Inc. provides overnight air freight service to the express delivery industry in the United States, Canada, Puerto Rico, and the Virgin Islands. The Company also provides aviation ground support equipment products.","DS588":"www.airt.net"}},{"security":"ATSG US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":77,"fieldData":{"DS318":"Air Transport Services Group Inc., through its subsidiary, provides air cargo transportation and hub services within the United States and to Canada and Puerto Rico. The Company also provides aircraft leasing, airport ground services, fuel management, specialized transportation management, and air charter brokerage services.","DS588":"www.abxair.com"}},{"security":"AMCN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":78,"fieldData":{"DS318":"Airmedia Group, Inc. operates digital media advertising networks. The Company operates digital television screens displaying advertising in Chinese airports.","DS588":"www.airmedia.net.cn"}},{"security":"AIXG US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":79,"fieldData":{"DS318":"Aixtron SE engineers and manufactures metal organic chemical vapor deposition (MOCVD) equipment for the semiconductor industry. The Company's customers use its equipment to produce compound semiconductor layer structures for use in LED, laser, solar cell, transistor, telecommunications, and other applications. Aixtron markets its products worldwide.","DS588":"www.aixtron.com"}}]},{"securityData":[{"security":"ADMA US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":50,"fieldData":{"DS318":"ADMA Biologics, Inc. produces biomedical products. The Company develops and commercializes human plasma and plasma-derived therapeutics for immunity-compromised patients. ADMA Biologics conducts its business in the United States.","DS588":"www.admabiologics.com"}},{"security":"ADBE US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":51,"fieldData":{"DS318":"Adobe Systems Incorporated develops, markets, and supports computer software products and technologies. The Company's products allow users to express and use information across all print and electronic media. Adobe offers a line of application software products, type products, and content for creating, distributing, and managing information.","DS588":"www.adobe.com"}},{"security":"ADTN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":52,"fieldData":{"DS318":"ADTRAN, Inc. designs, develops, manufactures, markets, and services a variety of high-speed digital transmission products. The Company's products are used by telephone companies and corporate end-users to implement advanced digital data services over existing telephone networks. ADTRAN also offers a line of multiplexers which provides modular flexibility.","DS588":"www.adtran.com"}},{"security":"AAAP US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":53,"fieldData":{"DS318":"Advanced Accelerator Applications SA develops and manufactures diagnostic and therapeutic products. The Company offers radio-pharmaceuticals, molecules, and drugs for clinical oncology, cardiology, inflammatory diseases, and neurology. Advanced Accelerator Applications serves patients and medical professionals worldwide.","DS588":"www.adacap.com"}},{"security":"AEIS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":54,"fieldData":{"DS318":"Advanced Energy Industries, Inc. manufactures power conversion, solar inverters and control systems used in plasma-based thin film production equipment. The Company's systems are integrated in semiconductor, data storage, flat panel display, and other industrial manufacturing equipment that use gaseous plasmas to depositor etch thin film layers on materials such as silicon and glass.","DS588":"www.advanced-energy.com"}},{"security":"AMD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":55,"fieldData":{"DS318":"Advanced Micro Devices, Inc. manufactures semiconductor products. The Company manufactures products that include microprocessors, embedded microprocessors, chipsets, graphics, video and multimedia products. Advanced Micro Devices, Inc. offers its products on a global basis.","DS588":"www.amd.com"}},{"security":"ADXS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":56,"fieldData":{"DS318":"Advaxis Inc., is a biotechnology company. The Company develops therapeutic cancer vaccines targeting cervical, head & neck, breast, prostate, and other cancers.","DS588":"www.advaxis.com"}},{"security":"ADXSW US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":57,"fieldData":{"DS318":"Advaxis Inc., is a biotechnology company. The Company develops therapeutic cancer vaccines targeting cervical, head & neck, breast, prostate, and other cancers.","DS588":"www.advaxis.com"}},{"security":"ADVS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":58,"fieldData":{"DS318":"Advent Software, Inc. provides software products and related services that automate and integrate critical operations of investment management organizations. The Company provides a variety of products for the front, middle, and back offices of investment management organizations.","DS588":"www.advent.com"}},{"security":"MULT US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":59,"fieldData":{"DS318":"The AdvisorShares Sunrise Global Multi-Strategy ETF is an exchange traded fund incorporated in the USA. The Fund seeks to provide long-term total returns by investing long and short in a variety of asset classes and investment strategies.","DS588":"www.advisorshares.com"}}]},{"securityData":[{"security":"ARAY US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":30,"fieldData":{"DS318":"Accuray Inc. develops medical equipment. The Company produces radiation therapy and radiosurgery treatment systems. Accuray Inc. has developed an intelligent robotic radio surgery system designed to treat solid tumors anywhere in the body as an alternative to traditional surgery.","DS588":"www.accuray.com"}},{"security":"ACRX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":31,"fieldData":{"DS318":"AcelRx Pharmaceuticals Inc. is a specialty pharmaceutical company focused on the development and commercialization of therapies for the treatment of acute and breakthrough pain. The Company's solutions are designed to provide mild sedation, anxiety reduction and pain relief for patients undergoing painful procedures in a physician's office.","DS588":"www.acelrx.com"}},{"security":"ACET US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":32,"fieldData":{"DS318":"Aceto Corporation operates as an international marketing, sales and distribution company. The Company distributes industrial chemicals used in the agriculture, color producing, pharmaceutical, and surface coating industries.","DS588":"www.aceto.com"}},{"security":"AKAO US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":33,"fieldData":{"DS318":"Achaogen, Inc. provides biopharmaceutical products. The Company discovers, develops, and commercializes antibacterials to treat multi-drug resistant and gram-negative infections. Achaogen serves customers in the United States.","DS588":"www.achaogen.com"}},{"security":"ACHN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":34,"fieldData":{"DS318":"Achillion Pharmaceuticals Inc. is a biopharmaceutical company that discovers and develops solutions for infectious diseases such as HIV, hepatitis, and resistant bacterial infections.","DS588":"www.achillion.com"}},{"security":"ACIW US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":35,"fieldData":{"DS318":"ACI Worldwide, Inc. develops, markets, and supports software products for the global electronics funds transfer market. The Company's products are used to process transactions involving credit cards, debit cards, smartcards, home banking services, checks, and automated clearing and settlement.","DS588":"www.tsainc.com"}},{"security":"ACNB US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":36,"fieldData":{"DS318":"ACNB Corporation is the holding company for Adams County National Bank. The Company offers commercial and retail banking, trust, accounting and insurance services through a network of full-service offices in Adams, Cumberland and York counties in Pennsylvania. ACNB's Pennbanks Insurance Co. subsidiary reinsures credit life and credit accident and disability risks.","DS588":"www.acnb.com/main.asp"}},{"security":"ACOR US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":37,"fieldData":{"DS318":"Acorda Therapeutics Inc. is a biotechnology company that is developing therapies for spinal cord injury and related neurological conditions, including multiple sclerosis. Additionally, Acorda is developing multiple approaches to regeneration and repair of the spinal cord and brain.","DS588":"www.acorda.com"}},{"security":"ACFN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":38,"fieldData":{"DS318":"Acorn Energy Inc. through its subsidiaries, provides clean energy solutions. The Company's solutions include clean capacity, catalyst regeneration technologies, remote monitoring of the electric grid, underwater security systems for coastal energy infrastructure, and renewable power solutions.","DS588":"www.acornenergyinc.com"}},{"security":"ACTS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":39,"fieldData":{"DS318":"Actions Semiconductor Co. Ltd. is an IC design company. The Company provides system-on-a chip solutions for the development and manufacture of personal media or MP3 players.","DS588":"www.actions.com.cn"}}]},{"securityData":[{"security":"YPRO US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":60,"fieldData":{"DS318":"AdvisorShares YieldPro ETF is an exchange traded fund incorporated in the USA. The ETF seeks to provide current income and capital appreciation. The ETF is a \"fund of funds\" multi-asset income strategy, investing primarily in other exchange-traded products.","DS588":"www.advisorshares.com"}},{"security":"AEGR US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":61,"fieldData":{"DS318":"Aegerion Pharmaceuticals, Inc. is a biopharmaceutical company. The Company researches small-molecule therapeutics for cardiovascular and metabolic disease. Aegerion's product candidates limit secretion of cholesterol and triglycerides.","DS588":"www.aegerion.com"}},{"security":"AEGN US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":62,"fieldData":{"DS318":"Aegion Corp. provides technologies and services to protect, rehabilitate, strengthen, and extend the life of infrastructure assets including pipelines, bridges, buildings and waterfront structures. The Company provide a variety of infrastructure solutions to the energy and mining, commercial and structural, and water and wastewater markets.","DS588":"www.insituform.com"}},{"security":"AEHR US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":63,"fieldData":{"DS318":"Aehr Test Systems develops, manufactures, and sells systems which are designed to reduce the cost of testing Dynamic Random Access Memory and other memory devices. The Company's systems also enable integrated circuit manufacturers to perform test and burn-in of bare die. Aehr offers systems that perform screening of complex logic and memory devices.","DS588":"www.aehr.com"}},{"security":"AMTX US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":64,"fieldData":{"DS318":"Aemetis Inc. is a biotechnology company. The Company has engineered bacterium capable of converting whole plant materials into sugars that can then be used to make a range of commercially products in the biochemical and biofuels industries.","DS588":"www.aemetis.com"}},{"security":"AEPI US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":65,"fieldData":{"DS318":"AEP Industries Inc. manufactures plastic packaging films. The Company manufactures a variety of PVC, PE and PP commodity and specialty films. AEP's films are used to manufacture bags, sacks liners, labels and wrapping for the packaging, transportation, beverage, food, automotive, pharmaceutical, chemical, electronics, construction, agriculture and textile industries.","DS588":"www.aepinc.com"}},{"security":"AERI US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":66,"fieldData":{"DS318":"Aerie Pharmaceuticals, Inc. operates as a clinical-stage pharmaceutical company. The Company discovers, develops, and distributes pharmaceutical products for the treatment of glaucoma and other diseases of the eye. Aerie Pharmaceuticals serves customers worldwide.","DS588":"www.aeriepharma.com"}},{"security":"AVAV US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":67,"fieldData":{"DS318":"Aerovironment Inc. designs, develops, produces and supports small unmanned aircraft systems, and fast charge systems for electric industrial vehicle batteries.","DS588":"www.avinc.com"}},{"security":"AEZS US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":68,"fieldData":{"DS318":"AEterna Zentaris Inc is a specialty biopharmaceutical company engaged in developing novel treatments in oncology and endocrinology. The Company's pipeline encompasses compounds from drug discovery to regulatory approval.","DS588":"www.aeternazentaris.com"}},{"security":"AFMD US Equity","eidData":[],"fieldExceptions":[],"sequenceNumber":69,"fieldData":{"DS318":"Affimed Therapeutics B.V. is a clinical-stage biopharmaceutical company focused on discovering and developing targeted cancer immunotherapies.","DS588":"www.affimed.com"}}]}],"status":0,"message":"OK"} 